[
  {
    "id": "pub-1",
    "title": "IMAGE ENHANCEMENT MENGGUNAKAN MULTI-HISTOGRAM EQUALIZATION BERBASIS HSV COLOR SPACE DENGAN SPATIAL CONSTRAINED FUZZY C-MEANS ",
    "authors": [
      "Adidya Abimanyu",
      "Ayasha Anggun Anindya",
      "Rasyid Muhammad Agha"
    ],
    "venue": "Sebelas Maret University Conference on Computer Science (Under Review)",
    "year": 2024,
    "status": "Under Review",
    "doi": null,
    "pdf": "/papers/image-enhancement-2025.pdf",
    "arxiv": "https://arxiv.org/abs/XXXX.XXXXX",
    "abstract": "Peningkatan kualitas citra digital merupakan aspek penting dalam berbagai aplikasi seperti kesehatan, pengawasan, dan penginderaan jarak jauh. Metode klasik histogram equalization (HE) sering mengalami kelemahan seperti pergeseran kecerahan dan over-enhancement yang menyebabkan hilangnya detail. Penelitian ini mengembangkan metode image enhancement berbasis multi-histogram equalization dengan memanfaatkan Spatial-Constrained Fuzzy C-Means pada HSV color space untuk menghasilkan segmentasi histogram yang lebih robust. Metode ini mengintegrasikan spatial constraint dengan bobot α = 0.85 pada proses clustering FCM untuk meningkatkan robustness terhadap noise. Evaluasi dilakukan pada 6 dataset standar (Berkeley, CSIQ, Kodak, USC-SIPI, UCMerced, dan SIRI-WHU) dengan total 5.064 citra menggunakan metrik SSIM, IE, AMBE, dan FSIM. Hasil eksperimen menunjukkan metode HSV Spatial FCM mengungguli baseline dengan peningkatan SSIM +2.35%, penurunan AMBE -14.66%, dan peningkatan FSIM +8.93%. Metode ini mencapai performa excellent dengan SSIM > 0.99 pada Kodak (0.9942) dan CSIQ (0.9951), serta menunjukkan konsistensi pada berbagai kategori brightness dengan range SSIM 0.8727-0.9951. Integrasi spatial constraint terbukti efektif meningkatkan structural preservation, brightness preservation, dan perceptual quality, menjadikan metode ini dapat digeneralisasi untuk berbagai aplikasi image enhancement.",
    "tags": [
      "Image Processing",
      "Computer Vision",
      "Clustering",
      "Enhancement"
    ],
    "citations": 0,
    "order": 1
  },
  {
    "id": "pub-2",
    "title": "Peningkatan Robustness Model End-to-End Steganografi Gambar AttenHideNet terhadap Beragam Distorsi melalui Adversarial Training",
    "authors": [
      "Adidya Abimanyu",
      "Research Partner"
    ],
    "venue": "Sebelas Maret University Conference on Computer Science (In Preparation)",
    "year": 2025,
    "status": "In Preparation",
    "doi": null,
    "pdf": null,
    "arxiv": null,
    "abstract": "We propose an enhanced deep steganography framework based on AttenHideNet architecture with adversarial training to improve robustness against many types of attacks.",
    "tags": [
      "Deep Learning",
      "Steganography",
      "Security",
      "Adversarial Training"
    ],
    "citations": 0,
    "order": 2
  }
]